package net.okdi.core.util;

import java.io.IOException;
import java.util.ArrayList;
import java.util.Date;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

import com.alibaba.fastjson.JSON;
import com.alibaba.fastjson.JSONArray;
import com.alibaba.fastjson.JSONObject;

/**
 * @Description: 敏感词过滤
 * @Project：test
 * @Author : zhengjiong
 * @Date ： 2016年10月20日 14:18:17
 * @version 1.0
 */
public class NewSensitivewordFilter {


    /** 直接禁止的 */  
    private HashMap keysMap   = new HashMap();  
    private int  matchType = 1;            // 1:最小长度匹配 2：最大长度匹配  
  
    private static Map<String,Object> map = new HashMap<String,Object>();
    public void addKeywords(List<String> keywords)  
    {  
        for (int i = 0; i < keywords.size(); i++)  
        {  
            String key = keywords.get(i).trim();  
            HashMap nowhash = null;  
            nowhash = keysMap;  
            for (int j = 0; j < key.length(); j++)  
            {  
                char word = key.charAt(j);  
                Object wordMap = nowhash.get(word);  
                if (wordMap != null)  
                {  
                    nowhash = (HashMap) wordMap;  
                } else  
                {  
                    HashMap<String, String> newWordHash = new HashMap<String, String>();  
                    newWordHash.put("isEnd", "0");  
                    nowhash.put(word, newWordHash);  
                    nowhash = newWordHash;  
                }  
                if (j == key.length() - 1)  
                {  
                    nowhash.put("isEnd", "1");  
                }  
            }  
        }  
    }  
  
    /** 
     * 重置关键词 
     */  
    public void clearKeywords()  
    {  
        keysMap.clear();  
    }  
  
    /** 
     * 检查一个字符串从begin位置起开始是否有keyword符合， 如果有符合的keyword值，返回值为匹配keyword的长度，否则返回零 
     * flag 1:最小长度匹配 2：最大长度匹配 
     */  
    private int checkKeyWords(String txt, int begin, int flag)  
    {  
        HashMap nowhash = null;  
        nowhash = keysMap;  
        int maxMatchRes = 0;  
        int res = 0;  
        int l = txt.length();  
        char word = 0;  
        for (int i = begin; i < l; i++)  
        {  
            word = txt.charAt(i);  
            Object wordMap = nowhash.get(word);  
            if (wordMap != null)  
            {  
                res++;  
                nowhash = (HashMap) wordMap;  
                if (((String) nowhash.get("isEnd")).equals("1"))  
                {  
                    if (flag == 1)  
                    {  
                        wordMap = null;  
                        nowhash = null;  
                        txt = null;  
                        return res;  
                    } else  
                    {  
                        maxMatchRes = res;  
                    }  
                }  
            } else  
            {  
                txt = null;  
                nowhash = null;  
                return maxMatchRes;  
            }  
        }  
        txt = null;  
        nowhash = null;  
        return maxMatchRes;  
    }  
  
    /** 
     * 返回txt中关键字的列表 
     */  
    public List<String> getTxtKeyWords(String txt)  
    {  
        //使用hashset 集合返回 包含那几个 敏感字 不重复显示  
        List<String> list = new ArrayList<String>();  
        int l = txt.length();  
        for (int i = 0; i < l;)  
        {  
            int len = checkKeyWords(txt, i, matchType);  
            if (len > 0)  
            {  
               // String tt = "<font color='#ff0000'>" + txt.substring(i, i + len) + "</font>";  
            	String tt =txt.substring(i, i + len);  
                list.add(tt);  
                i += len;  
            } else  
            {  
                i++;  
            }  
        }  
        txt = null;  
        return list;  
    }  
  
    /** 
     * 仅判断txt中是否有关键字 
     */  
    public boolean isContentKeyWords(String txt)  
    {  
        for (int i = 0; i < txt.length(); i++)  
        {  
            int len = checkKeyWords(txt, i, 1);  
            if (len > 0)  
            {  
                return true;  
            }  
        }  
        txt = null;  
        return false;  
    }  
    /** 
     * 初始化敏感词列表 
     * */  
    public void initfiltercode(List<String> list)  
    {  
        List<String> keywords = new ArrayList<String>();  
        String black="{\"data\":[\"水阎王\",\"考试答案\",\"各类考试\",\"港澳博球\",\"奇迹的黄\",\"办理资格\",\"导航\",\"国家妓\",\"老虎机\"," +
        		"\"fuck\",\"逼\",\"安门事\",\"隐形耳\",\"麻果丸\",\"门按摩\",\"复印件制\",\"民主\",\"考机构\",\"三挫\",\"强奸\",\"警察的幌\",\"售麻醉\"," +
        		"\"考设备\",\"特上门\",\"售猎枪\",\"阴道\",\"考试保\",\"配有消\",\"售弹簧刀\",\"告洋状\",\"伦理片\",\"维权基\",\"十七大幕\",\"理是影帝\"," +
        		"\"江贼民\",\"拉登说\",\"手机监\",\"布卖淫女\",\"卖银行卡\",\"环球证件\",\"冈本真\",\"惩公安\",\"擠乳汁\",\"就爱插\",\"net\",\"被指抄袭\"," +
        		"\"肛交\",\"港鑫華\",\"淫肉\",\"网民诬\",\"官商勾\",\"专业代写\",\"赚钱资料\",\"地震哥\",\"代辦\",\"务员答案\",\"嫖鸡\",\"天朝特\",\"醉迷药\"," +
        		"\"叫自慰\",\"理各种证\",\"成人小\",\"漫步丝\",\"右转是政\",\"当官要精\",\"戴海静\",\"金扎金\",\"枪决现场\",\"開票\",\"陰唇\",\"杀指南\"," +
        		"\"维汉员\",\"吸精\",\"被中共\",\"指纹膜\",\"伦理电影\",\"港馬會\",\"代办发票\",\"打死人\",\"请集会\",\"证书办\",\"拆迁灭\",\"左转是政\"," +
        		"\"女性\",\"把学生整\",\"国家软弱\",\"真钱斗地\",\"一小撮别\",\"骑单车出\",\"枪手网\",\"售一元硬\",\"独立台湾\",\"开邓选\",\"不查都\"," +
        		"\"专业办理\",\"代写论\",\"成人电\",\"儿园杀\",\"四博会\",\"被打死\",\"抽着大中\",\"出售发票\",\"考前答\",\"售单管\",\"公开小姐\"," +
        		"\"富民穷\",\"敬请忍\",\"两会又三\",\"酸羟亚胺\",\"八九学\",\"体透视镜\",\"文凭证\",\"氢弹手\",\"闻被控制\",\"巨乳\",\"本公司担\"," +
        		"\"不思四化\",\"冰火毒\",\"韶关斗\",\"民储害\",\"奇淫散\",\"京地震\",\"代理票据\",\"幕没有不\",\"丝袜妹\",\"至国家高\",\"家一样饱\"," +
        		"\"铅弹\",\"六四事\",\"韶关玩\",\"冲凉死\",\"康跳楼\",\"透视镜\",\"兴中心幼\",\"活不起\",\"限制言\",\"夫妻交换\",\"枪的参\",\"挨了一炮\"," +
        		"\"售军用\",\"当官在于\",\"三级片\",\"生被砍\",\"福尔马林\",\"机卡密\",\"东复活\",\"装b\",\"纯度黄\",\"酒象喝汤\",\"胸主席\",\"骚嘴\"," +
        		"\"府集中领\",\"女人和狗\",\"麻醉藥\",\"韶关旭\",\"委坐船\",\"淫情女\",\"胡紧套\",\"殖器护\",\"习近\",\"守所死法\",\"枪\",\"虎头猎\"," +
        		"\"把病人整\",\"平叫到床\",\"麻将透\",\"售防身\",\"游精佑\",\"办理票据\",\"遭武警\",\"冰毒\",\"死要见毛\",\"屌\",\"红外透视\",\"屁\"," +
        		"\"紅色恐\",\"军长发威\",\"屄\",\"学骚乱\",\"泄漏的内\",\"克千术\",\"透视仪\",\"中共黑\",\"香港一类\",\"幼齿类\",\"学位證\",\"助考网\"," +
        		"\"素女心\",\"激情短\",\"迷昏藥\",\"醉钢枪\",\"攻官小姐\",\"虐待\",\"期货配\",\"作各种证\",\"贷办\",\"信誉\",\"大嘴歌\",\"迷藥\",\"制手枪\"," +
        		"\"毛泽\",\"淫兽\",\"诽谤罪\",\"瘟假饱\",\"阿扁推翻\",\"裸\",\"乳交\",\"插屁屁\",\"卖发票\",\"京要地震\",\"装枪套\",\"才知道只生\",\"射\"," +
        		"\"兼职上门\",\"洗澡死\",\"晕倒型\",\"新唐人\",\"径步枪\",\"手机追\",\"东京热\",\"监听\",\"炸药的制\",\"领土拿\",\"岡本真\",\"肏\",\"办本科\"," +
        		"\"证到付款\",\"喜贪赃\",\"跪真相\",\"范燕琼\",\"席复活\",\"轮功\",\"办证\",\"力月西\",\"强权政府\",\"汽枪\",\"车牌隐\",\"猎槍\",\"半刺刀\"," +
        		"\"琼花问\",\"文强\",\"阿宾\",\"顶花心\",\"钱三字经\",\"聊斋艳\",\"群起抗暴\",\"短信截\",\"做原子弹\",\"色视频\",\"湾版假\",\"蠢\",\"和狗性\"," +
        		"\"浑圆豪乳\",\"炸广州\",\"醉\",\"手木仓\",\"防电子眼\",\"先烈纷纷\",\"液体炸\",\"推油\",\"都当警\",\"胡耀邦\",\"雷人女官\",\"開碼\",\"灯草和\"," +
        		"\"卖地财政\",\"务员考试\",\"清除负面\",\"做爱小\",\"阿賓\",\"庭审直播\",\"成人视\",\"十大谎\",\"微型摄像\",\"空和雅典\",\"夜激情\",\"枪模\"," +
        		"\"安局办公楼\",\"现金投注\",\"吊\",\"洞小口紧\",\"深喉冰\",\"代您考\",\"疆獨\",\"瓮安\",\"肉棍\",\"女技师\",\"浓精\",\"娱乐透视\"," +
        		"\"无耻语录\",\"制作证件\",\"氣槍\",\"日日日\",\"肉棒\",\"杀\",\"灭绝罪\",\"罗斯小姐\",\"咏妓\",\"磅遥控器\",\"机号定\",\"温影帝\"," +
        		"\"视解密\",\"氓培训\",\"售健卫\",\"發票\",\"三秒倒\",\"伦理毛\",\"导小商\",\"考考邓\",\"气狗\",\"房贷给废\",\"丁子霖\",\"胡锦\"," +
        		"\"炮的小蜜\",\"贷借款\",\"津地震\",\"网民案\",\"还看锦涛\",\"改号软件\",\"十大禁\",\"蒋彦永\",\"工资\",\"等屁民\",\"摩小姐\"," +
        		"\"枪货到\",\"枪械制\",\"发牌绝\",\"集体打砸\",\"田罢工\",\"狮子旗\",\"六月联盟\",\"园砍杀\",\"控制媒\",\"氰化钠\",\"据说全民\"," +
        		"\"冰火九重\",\"撸\",\"白黄牙签\",\"自己找枪\",\"激情电\",\"迷魂藥\",\"丝袜恋\",\"售热武\",\"维权人\",\"着涛哥\",\"袁腾飞\",\"浪穴\"," +
        		"\"操\",\"津大地震\",\"炸药配\",\"民抗议\",\"震惊一个民\",\"售火药\",\"烧瓶的\",\"字牌汽\",\"搞媛交\",\"透视器\",\"生肖中特\",\"要人权\"," +
        		"\"麻古\",\"藏春阁\",\"龙湾事件\",\"真实文凭\",\"要射精了\",\"出售\",\"跟踪器\",\"机号卫\",\"五套功\",\"毕业證\",\"性推广歌\",\"遗情书\"," +
        		"\"奶头\",\"打飞机\",\"等人老百\",\"波推龙\",\"宙最高法\",\"炼大法\",\"迷魂药\",\"迷情水\",\"女優\",\"com\",\"维权谈\",\"砍杀幼\"," +
        		"\"天鹅之旅\",\"惩贪难\",\"警车雷达\",\"和狗做\",\"迷情药\",\"专业代\",\"丝袜保\",\"罢工门\",\"麻醉枪\",\"爆发骚\",\"州三箭\",\"清純壆\"," +
        		"\"共王储\",\"美艳少妇\",\"投资\",\"哈药直销\",\"富婆给废\",\"李咏曰\",\"考试枪\",\"炸弹遥控\",\"与狗性\",\"苏家屯集\",\"武警殴\"," +
        		"\"售三棱\",\"胡适眼\",\"绩过后付\",\"反屏蔽\",\"金钟气\",\"狗屁专家\",\"华国锋\",\"枪销售\",\"北省委门\",\"请愿\",\"对日强硬\"," +
        		"\"江系人\",\"发票代\",\"习进平\",\"监听器\",\"猎枪销\",\"军用手\",\"酒像喝汤\",\"禽流感了\",\"氰化钾\",\"缠绵\",\"地产之歌\"," +
        		"\"简易炸\",\"警用品\",\"导的情人\",\"如厕死\",\"南充针\",\"忙爱国\",\"针刺死\",\"蒙汗药\",\"甲流了\",\"法院给废\",\"强硬发言\"," +
        		"\"田田桑\",\"兽交\",\"住英国房\",\"存款\",\"色电影\",\"赌球网\",\"蜜穴\",\"谓的和谐\",\"售信用\",\"择油录\",\"肛门是邻\",\"射网枪\"," +
        		"\"王益案\",\"干你\",\"矿难不公\",\"枪的分\",\"安眠藥\",\"雾型迷\",\"配方\",\"骚浪\",\"电话监\",\"福娃頭上\",\"牌技网\",\"得财兼\"," +
        		"\"开苞\",\"速取证\",\"娶韩国\",\"冰在火上\",\"十八等\",\"隐形喷剂\",\"做爱\",\"保过答案\",\"等人手术\",\"舔\",\"性交\",\"察象蚂\"," +
        		"\"益关注组\",\"考试联盟\",\"乖乖粉\",\"和狗交\",\"警察被\",\"考中答案\",\"刻章\",\"辦毕业\",\"湖淫娘\",\"办怔\",\"考联盟\",\"麻果配\"," +
        		"\"众像羔\",\"迷幻藥\",\"手机跟\",\"木齐针\",\"答案提供\",\"闻封锁\",\"躲猫猫\",\"应子弹\",\"泰兴幼\",\"方迷香\",\"赵紫阳\",\"群体性事\"," +
        		"\"喷尿\",\"资料泄\",\"售五四\",\"本无码\",\"1111\",\"淫兽学\",\"乱伦小\",\"法一轮\",\"不查全\",\"万人骚动\",\"姐服务\",\"枪的制\",\"偷電器\"," +
        		"\"党前干劲\",\"门保健\",\"遭到警\",\"九评共\",\"任于斯国\",\"全真证\",\"成人片\",\"谜奸药\",\"政府操\",\"十个预言\",\"佳静安定\",\"找枪手\"," +
        		"\"透视功能\",\"私房写真\",\"信访专班\",\"高考\",\"售假币\",\"出成绩付\",\"女上门\",\"有奶不一\",\"城管灭\",\"娘两腿之间\",\"售纯度\"," +
        		"\"昼将近\",\"猫眼工具\",\"枪手队\",\"砍伤儿\",\"安街逆\",\"公安错打\",\"导叫失\",\"袭击\",\"鸳鸯洗\",\"甸果敢\",\"导人的最\"," +
        		"\"钢针狗\",\"无码专\",\"恶势力操\",\"败培训\",\"电狗\",\"妇销魂\",\"办理各种\",\"淫水\",\"炸弹教\",\"推油按\",\"枪子弹\"," +
        		"\"术牌具\",\"实体娃\",\"复辟\",\"法伦功\",\"证件集团\",\"情聊天室\",\"高莺莺\",\"帝国之梦\",\"聊视频\",\"盐酸曲\",\"家属被打\"," +
        		"\"气枪\",\"发票\",\"阴蒂\",\"充气娃\",\"田停工\",\"种公务员\",\"乱伦类\",\"大揭露\",\"诉讼集团\",\"诚邀\",\"划老公\",\"迷昏药\"," +
        		"\"窃听器\",\"淫騷妹\",\"相自首\",\"售枪支\",\"淫\",\"平惨案\",\"原装弹\",\"柔胸粉\",\"打飞机专\",\"淫魔舞\",\"落霞缀\",\"园惨案\"," +
        		"\"万能钥匙\",\"国际投注\",\"天安门\",\"新疆限\",\"法车仑\",\"黎阳平\",\"围攻上海\",\"手机窃\",\"考试机构\",\"手狗\",\"把邓小平\"," +
        		"\"聯繫電\",\"骚妇\",\"警察说保\",\"煽动不明\",\"基本靠吼\",\"州惨案\",\"军刺\",\"口交\",\"我搞台独\",\"色妹妹\",\"性感少\",\"海访民\"," +
        		"\"激情妹\",\"pussy\",\"自慰\",\"跪\",\"妞上门\",\"妹按摩\",\"种学历证\",\"情视频\",\"仿真\",\"级办理\",\"陪考枪\",\"鼓动一些\"," +
        		"\"还会吹萧\",\"警察殴打\",\"煽动群众\",\"遭便衣\",\"陰戶\",\"江太上\",\"陷害案\",\"国一九五七\",\"胡錦濤\",\"四小码\",\"涉嫌抄袭\"," +
        		"\"答案\",\"抱\",\"头双管\",\"轮手枪\",\"共产党\",\"丫与王益\",\"手变牌\",\"妹上门\",\"考答案\",\"笨\",\"连发手\",\"午夜电\"," +
        		"\"外围赌球\",\"火车也疯\",\"内射\",\"找政法委副\",\"辩词与梦\",\"财众科技\",\"韵徐娘\",\"突破封锁\",\"恶势力插\",\"挫仑\"," +
        		"\"纹了毛\",\"找援交\",\"型手枪\",\"钢珠枪\",\"达毕业证\",\"考后付款\",\"人在云上\",\"国库折\",\"姓忽悠\",\"足球玩法\",\"麻醉槍\"," +
        		"\"激情\",\"台湾\",\"天推广歌\",\"冤民大\",\"公安网监\",\"博彩娱\",\"党的官\",\"妈\",\"太王四神\",\"香港总彩\",\"迷幻药\",\"园凶杀\"," +
        		"\"國內美\",\"办文凭\",\"豪圈钱\",\"满洲\",\"cn\",\"泽民\",\"通钢总经\",\"军品特\",\"偷听器\",\"手拉鸡\",\"换妻\",\"证生成器\"," +
        		"\"中的班禅\",\"扫了爷爷\",\"sex\",\"藏独\",\"毛一鲜\",\"黑火药的\",\"席指着护\",\"利他林\",\"售狗子\",\"成人\",\"明慧网\"," +
        		"\"婴儿命\",\"想你\",\"了件渔袍\",\"贷开\",\"发票销\",\"毒蛇钻\",\"资格證\",\"皇冠投注\",\"学历\",\"薄\",\"西服进去\",\"法维权\"," +
        		"\"普通嘌\",\"代办制\",\"丝护士\",\"党\",\"瘟加饱\",\"迷奸药\",\"当代七整\",\"av\",\"涛一样胡\",\"贱\",\"六四\",\"午夜极\"," +
        		"\"售手枪\",\"人权律\",\"宝在甘肃修\",\"姚明进去\",\"邓玉娇\",\"泰州幼\",\"瓜婆\",\"究生答案\",\"园发生砍\",\"发票出\",\"八九政治\"," +
        		"\"软弱的国\",\"拦截器\",\"东北独立\",\"恩氟烷\",\"司长期有\",\"傻\",\"变牌绝\",\"猎好帮手\",\"两岸\",\"代孕\",\"丝足按\"," +
        		"\"实毕业证\",\"点数优惠\",\"作硝化甘\",\"性福情\",\"穴\",\"股票\",\"安局豪华\",\"嫩穴\",\"甲虫跳\",\"作弊器\",\"证一次性\"," +
        		"\"等级證\",\"成人卡通\",\"代理\",\"案的准确\",\"赛后骚\",\"育部女官\",\"两岸才子\",\"替人体\",\"蹋纳税\",\"各类文凭\",\"名单\"," +
        		"\"法轮\",\"切听器\",\"理做帐报\",\"瓜娃\",\"代办\",\"论坛\",\"举国体\",\"策没有不\",\"勤捞致\",\"中国不强\",\"mb\",\"證件\"," +
        		"\"打死经过\",\"针刺伤\",\"藏獨\",\"枪的结\",\"司法黑\",\"温切斯特\",\"你的西域\",\"圣战不息\",\"主席忏\",\"开锁工具\",\"肉洞\"," +
        		"\"绕过封锁\",\"佛同修\",\"催情药\",\"刀架保安\",\"文凭\",\"枪决女犯\",\"新金瓶\",\"迷幻型\",\"炸立交\",\"克分析\",\"苍山兰\"," +
        		"\"女激情\",\"纯度白\",\"指纹考勤\",\"幸运码\",\"法轮佛\",\"手槍\",\"华门开\",\"辦證\",\"双管立\",\"残害\",\"苍蝇水\",\"jj\"," +
        		"\"资金\",\"州大批贪\",\"乌蝇水\",\"理财\",\"玉蒲团\",\"香港马会\",\"理证件\",\"特码\",\"书办理\",\"坐台\",\"催眠水\",\"次通过考\"," +
        		"\"烧公安局\",\"死法分布\",\"小穴\",\"封锁消\",\"失身水\",\"官因发帖\",\"告长期\",\"希脏\",\"蟆叫专家\",\"新疆叛\",\"挤乳汁\",\"毒\"," +
        		"\"博园区伪\",\"部是这样\",\"武警暴\",\"咨询\",\"骷髅死\",\"精子射在\",\"感扑克\",\"震其国土\",\"着护士的胸\",\"幽谷三\",\"偷偷贪\"," +
        		"\"原一九五七\",\"都当小姐\",\"盛行在舞\",\"五月天\",\"要泄了\",\"口手枪\",\"康没有不\",\"式粉推\",\"领导\",\"脱衣艳\",\"鸡巴\"," +
        		"\"狼全部跪\",\"黄冰\",\"俄羅斯\",\"嫖俄罗\",\"用手枪\",\"严晓玲\",\"费用\",\"机屏蔽器\",\"实学历文\",\"冰淫传\",\"jb\",\"拟涛哥\"," +
        		"\"最牛公安\",\"博会暂停\",\"爷\",\"监听王\",\"西藏限\",\"爸\",\"针刺事\",\"转让\",\"抢其火炬\",\"爱液横流\",\"硝化甘\",\"母乳家\"," +
        		"\"東京熱\",\"梓健特药\",\"士康事件\",\"王立军\",\"张春桥\",\"电鸡\",\"孔摄像\",\"小姐\",\"催情粉\",\"2b\",\"费私服\",\"成人聊\"," +
        		"\"类准确答\",\"集体腐\",\"成人文\",\"出售军\",\"级答案\",\"府包庇\",\"志不愿跟\",\"江胡内斗\",\"真钱投注\",\"儿园惨\",\"淫穴\"," +
        		"\"两会代\",\"是躲猫\",\"部忙组阁\",\"围攻警\",\"办理\",\"贪官也辛\",\"菊花\",\"形透视镜\",\"请示威\",\"十类人不\",\"脱光\",\"data\"," +
        		"\"恙虫病\",\"人真钱\",\"报复执法\",\"习大大\",\"儿园凶\",\"大批贪官\",\"大纪元\",\"言论罪\",\"导人最\",\"替考\",\"温家堡\"," +
        		"\"姿不对死\",\"行长王益\",\"女任职名\",\"溫家寶\",\"总会美女\",\"代表烦\",\"嫩阴\",\"遭警察\",\"透视药\",\"附送枪\",\"色小说\"," +
        		"\"力骗中央\",\"控诉世博\",\"透视眼镜\",\"枪出售\",\"协晃悠\",\"国母\",\"装弹甲\",\"奸成瘾\",\"售氯胺\",\"仿真证\",\"大奶子\"," +
        		"\"tm\",\"铭记印尼\",\"踩踏事\",\"侦探设备\",\"装消音\",\"大鸡巴\",\"姐上门\",\"幕前戲\",\"獵槍\",\"仿真枪\",\"迷魂香\",\"性爱日\"," +
        		"\"失意药\",\"春水横溢\",\"采花堂\",\"sm\",\"女被人家搞\",\"拍肩神药\",\"贷款\",\"熟妇\",\"到花心\",\"儿园砍\",\"指纹套\",\"sb\"," +
        		"\"陆封锁\",\"真实资格\",\"园血案\",\"星上门\",\"益受贿\",\"网民获刑\",\"蚁力神\",\"裸舞视\",\"专业助\",\"考前付\",\"法正乾\"," +
        		"\"百家乐\",\"催情藥\",\"考研考中\",\"伦理大\",\"隆手指\",\"徐玉元\",\"人体艺\",\"区的雷人\",\"工力人\",\"进来的罪\",\"自由圣\"," +
        		"\"代理发票\",\"供应\",\"迷昏口\",\"透视\",\"陷害罪\",\"神韵艺术\",\"冰火漫\",\"64\",\"手答案\",\"狗粮\",\"山涉黑\",\"八九民\",\"卧槽\",\"拉开水晶\",\"激情炮\"," +
        		"\"媒体封锁\",\"曾道人\",\"民九亿商\",\"丝情侣\",\"政论区\",\"抽着芙蓉\",\"中奖\",\"代办各\",\"售子弹\",\"px\",\"自由亚\",\"真善忍\",\"炸药制\",\"流水\",\"九龙论坛\"," +
        		"\"认牌绝\",\"麻醉狗\",\"泥马之歌\",\"福香巴\",\"暴力\",\"反测速雷\",\"售冒名\",\"大雞巴\",\"制证定金\",\"都进中央\",\"陆同修\",\"神七假\",\"vip\",\"愚民政\",\"突破网路\"," +
        		"\"磅解码器\",\"颜射\",\"蝶舞按\",\"红色恐怖\",\"鸥之歌\",\"生踩踏\",\"透视扑\",\"席临终前\",\"打砸办公\",\"答案包\",\"制服诱\",\"多美康\",\"仆不怕饮\",\"反雷达测\"," +
        		"\"办理文凭\",\"陰道\",\"四大扯个\",\"党后萎\",\"操嫂子\",\"考试包过\",\"删帖\",\"裸聊网\",\"特工资\",\"涛共产\",\"shit\",\"自慰用\",\"官也不容\",\"克透视\"," +
        		"\"六合彩\",\"滚圆大乳\",\"机定位器\",\"国家吞得\",\"就要色\",\"来福猎\",\"org\",\"流血事\",\"惹的国\",\"共狗\",\"习晋平\",\"秃鹰汽\",\"线透视镜\",\"我的西域\"," +
        		"\"炸\",\"防身药水\",\"二奶大\",\"论文代\",\"号屏蔽器\",\"汽狗\",\"人游行\",\"大肉棒\",\"植物冰\",\"写两会\",\"转是政府\",\"群奸暴\",\"學生妹\",\"售虎头\"," +
        		"\"办理证书\",\"瓦斯手\",\"成人图\",\"冰火佳\",\"复印件生\",\"考前答案\",\"招聘\",\"骚穴\",\"中共\",\"拍肩型\",\"信接收器\",\"怒的志愿\",\"代写毕\",\"学潮\"," +
        		"\"丽媛离\",\"外透视镜\",\"愚民同\",\"香港论坛\",\"光学真题\",\"警方包庇\",\"丁香社\",\"办理真实\",\"每周一死\",\"代办文\",\"門服務\",\"快速办\",\"尸博\",\"刀\"," +
        		"\"胡江内斗\",\"揭贪难\",\"情自拍\",\"穿透仪器\",\"钱庄\",\"袜按摩\",\"姐包夜\",\"递纸死\",\"要射了\",\"乱奸\",\"烟感器\",\"三网友\",\"谤罪获刑\",\"氯胺酮\"," +
        		"\"的同修\",\"售左轮\",\"代办学\",\"做证件\",\"兼职\",\"庭保养\",\"上门激\",\"现大地震\",\"校骚乱\",\"三唑\",\"丝袜网\",\"姐兼职\",\"急需嫖\",\"援交\",\"偷肃贪\"," +
        		"\"福娃的預\",\"亂倫\",\"工程吞得\",\"退党\",\"泰兴镇中\",\"ass\",\"唑仑\",\"售步枪\",\"操了嫂\",\"情妹妹\",\"磕彰\",\"阴间来电\",\"速代办\",\"针刺案\",\"探测狗\"," +
        		"\"经典谎言\",\"尊爵粉\",\"高就在政\",\"言被劳教\",\"高考黑\",\"双管平\",\"武警已增\",\"格证考试\",\"办理本科\",\"绝食声\",\"牌分析\",\"李洪志\",\"证件办\",\"新建户\"," +
        		"\"邓爷爷转\",\"化学扫盲\",\"六死\",\"签证\",\"丝袜美\",\"地下先烈\",\"助考\",\"卖自考\",\"醉乙醚\",\"等人是老\",\"【\",\"】\",\"[\",\"]\"]}";
       /* InputStream in = NewSensitivewordFilter.class.getClassLoader().getResourceAsStream("words.properties");  
        Properties pro = new Properties();  
        try  
        {  
            pro.load(in);  
            in.close();  
        } catch (IOException e1)  
        {  
            e1.printStackTrace();  
        }  
        Enumeration<String> enu = (Enumeration<String>) pro.propertyNames();  
        while (enu.hasMoreElements())  
        {  
            try  
            {  
                String dd = (String) enu.nextElement();  
                dd = new String(dd.getBytes("ISO8859-1"), "UTF-8"); 
                //keywords.add(dd);  
                String str1 = "签证";
                String str2 = "水阎王";
                String str3 = "老虎机";
                keywords.add(str1); 
                keywords.add(str2); 
                keywords.add(str3); 
            } catch (UnsupportedEncodingException e)  
            {  
                e.printStackTrace();  
            }  
        }  */
        JSONObject fromObject=JSONObject.parseObject(black);
        JSONArray jsonArray = fromObject.getJSONArray("data");
        List<String> list1 = JSON.parseArray(jsonArray.toString(),String.class);
        addKeywords(list1);  
    }  
    public int getMatchType()  
    {  
        return matchType;  
    }  
  
    public void setMatchType(int matchType)  
    {  
        this.matchType = matchType;  
    }  
  
    public static void main(String[] args) throws IOException  
    {  
        Date date = new Date();  
        NewSensitivewordFilter filter = new NewSensitivewordFilter();  
        filter.initfiltercode(null);  
        String txt = "她长孙家提携恩情，FL大法不会有人去追查这件事的老虎机，中南海权力斗争就一次水阎王，就一次签证，好吗？";  
        boolean boo = filter.isContentKeyWords(txt);  
        System.out.println(boo);  
        List<String> set = filter.getTxtKeyWords(txt);  
        System.out.println("包含的敏感词如下："+set);
        if(set != null && set.size() > 0){
        	for (String string : set) {
        		String object = map.get(string)+"";
        		if("8".equals(object)){
        			System.out.println("营销");
        		}else if("0".equals(object)){
        			System.out.println("其他");
        		}else if("1194".equals(object)){
        			System.out.println("黑名单");
        		}
			}
        }
        Date date2 = new Date();  
        float ss = date2.getTime() - date.getTime();  
        System.out.println(ss + "毫秒");  
    }  
   
}
